src/InformationRegisters/IndividualDocuments.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<InformationRegister>
		<Properties>
			<Name>IndividualDocuments</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Series</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Number</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>IssueDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ValidityPeriod</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Issuer</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>IsIdentityDocument</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Presentation</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Individual</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Individuals</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>DocumentKind</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.IdentityDocumentKinds</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/IndividualDocuments/Ext/ManagerModule.bsl
// Function returns id document effective on the specified date
//
// Parameters
//	Individual				- individual, for whom document should be obtained
//	Date			- date, on which we need to get the document
//
// Value to return:
//	Presentation	- string - id document presentation
//
Function DocumentCertifyingPersonalityOfInd(Individual, Date = Undefined) Export
	
	Query = New Query;
	Query.SetParameter("Individual",	Individual);
	Query.SetParameter("SliceDate",	Date);
	
	Query.Text =
	"SELECT TOP 1
	|	IndividualDocuments.Presentation
	|FROM
	|	InformationRegister.IndividualDocuments AS IndividualDocuments
	|		INNER JOIN (SELECT
	|			MAX(IndividualDocuments.Period) AS Period,
	|			IndividualDocuments.Individual AS Individual
	|		FROM
	|			InformationRegister.IndividualDocuments AS IndividualDocuments
	|		WHERE
	|			IndividualDocuments.IsIdentityDocument
	|			And IndividualDocuments.Individual = &Individual
	|			" + ?(Date <> Undefined, "And IndividualDocuments.Period <= &SliceDate", "") + "
	|		
	|		GROUP BY
	|			IndividualDocuments.Individual) AS DocumentsSlice
	|		ON IndividualDocuments.Period = DocumentsSlice.Period
	|			And IndividualDocuments.Individual = DocumentsSlice.Individual
	|			And (IndividualDocuments.IsIdentityDocument)";
	Selection = Query.Execute().Choose();
	
	PersonIdentity = New Structure("Presentation, IsIdentity");
	
	If Selection.Next() Then
		Return Selection.Presentation;
	EndIf;
	
	Return "";
	
EndFunction

// Function checks, if specified document type is an id dicument
//
// Parameters
//	Individual				- individual, for whom document should be obtained
//	DocumentKind	- document type, certifying person identity
//	Date			- date, on which we need to get the document
//
// Value to return:
//	IsIDDocument	- boolean - if specified document type is an id dicument
//
Function IsPersonID(Individual, DocumentKind, Date) Export
	
	If Individual.IsEmpty() Or DocumentKind.IsEmpty() Or Not ValueIsFilled(Date) Then
		Return False;
	EndIf;
	
	If DocumentKind = Catalogs.IdentityDocumentKinds.PassportRF Then
		Return True;
	EndIf;
	
	Query = New Query;
	Query.SetParameter("Individual",			Individual);
	Query.SetParameter("DocumentKind",	DocumentKind);
	Query.SetParameter("SliceDate",		Date);
	
	Query.Text =
	"SELECT
	|	IndividualDocuments.DocumentKind
	|FROM
	|	InformationRegister.IndividualDocuments AS IndividualDocuments
	|		INNER JOIN (SELECT
	|			MAX(IndividualDocuments.Period) AS Period,
	|			IndividualDocuments.Individual AS Individual
	|		FROM
	|			InformationRegister.IndividualDocuments AS IndividualDocuments
	|		WHERE
	|			IndividualDocuments.Individual = &Individual
	|			AND IndividualDocuments.Period < &SliceDate
	|			AND IndividualDocuments.IsIdentityDocument
	|		
	|		GROUP BY
	|			IndividualDocuments.Individual) AS DocumentsSlice
	|		ON IndividualDocuments.Individual = DocumentsSlice.Individual
	|			AND IndividualDocuments.Period = DocumentsSlice.Period
	|			AND (IndividualDocuments.DocumentKind = &DocumentKind)";
	Return Not Query.Execute().IsEmpty();
	
EndFunction
